package cn.maoookai.util;

@Deprecated
public class YokaiUtil {
    public static String[] SP = {"少羽大天狗", "炼狱茨木童子", "稻荷神御馔津", "苍风一目连", "赤影妖刀姬", "御怨般若", "骁浪荒川之主", "烬天玉藻前", "鬼王酒吞童子", "天剑韧心鬼切", "聆海金鱼姬", "浮世青行灯", "缚骨清姬", "待宵姑获鸟", "麓铭大岳丸", "初翎山风", "夜溟彼岸花"};
    public static String[] SSR = {"大天狗", "酒吞童子", "荒川之主", "阎魔", "小鹿男", "小鹿男", "小鹿男", "小鹿男", "小鹿男", "小鹿男", "茨木童子", "青行灯", "妖刀姬", "一目连", "花鸟卷", "辉夜姬", "荒", "彼岸花", "雪童子", "山风", "玉藻前", "御馔津", "面灵气", "鬼切", "白藏主", "八岐大蛇", "不知火", "大岳丸", "泷夜叉姬", "云外镜", "鬼童丸", "缘结神", "铃鹿御前", "紧那罗", "千姬"};
    public static String[] SR = {"桃花妖", "雪女", "鬼使白", "鬼使黑", "孟婆", "犬神", "骨女", "鬼女红叶", "跳跳哥哥", "傀儡师", "海坊主", "判官", "凤凰火", "吸血姬", "妖狐", "妖琴师", "食梦貘", "清姬", "镰鼬", "姑获鸟", "二口女", "白狼", "樱花妖", "惠比寿", "络新妇", "般若", "青坊主", "夜叉", "黑童子", "白童子", "烟烟罗", "金鱼姬", "鸩", "以津真天", "匣中少女", "书翁", "百目鬼", "追月神", "熏", "弈", "猫掌柜", "於菊虫", "一反木绵", "入殓师", "化鲸", "久次良", "蟹姬", "纸舞", "星熊童子", "风狸", "蝎女"};
    public static String[] R = {"三尾狐", "座敷童子", "鲤鱼精", "九命猫", "狸猫", "河童", "童男", "童女", "饿鬼", "巫蛊师", "鸦天狗", "食发鬼", "武士之灵", "雨女", "跳跳弟弟", "跳跳妹妹", "兵俑", "丑时之女", "独眼小僧", "铁鼠", "椒图", "管狐", "山兔", "萤草", "山童", "首无", "觉", "青蛙瓷器", "古笼火", "虫师"};
}
